app/controllers/home_controller.rb

  def index
    melbourne = Utc.find_by_value("Australia/Melbourne")
    tokyo = Utc.find_by_value("Asia/Tokyo")
    dan = Utc.find_by_value("America/Danmarkshavn")
    ma = Utc.find_by_value("Asia/Magadan")
    ab = Utc.find_by_value("America/Anchorage")
    @@cities = [melbourne, tokyo, ma, dan,ab]

    @utcs = Utc.all
---
SELECT  "utcs".* FROM "utcs" WHERE "utcs"."value" = $1 LIMIT $2  [["value", "Etc/GMT"], ["LIMIT", 1]]
SELECT  "utcs".* FROM "utcs" WHERE "utcs"."value" = $1 LIMIT $2  [["value", "America/Danmarkshavn"], ["LIMIT", 1]]
SELECT  "utcs".* FROM "utcs" WHERE "utcs"."value" = $1 LIMIT $2  [["value", "Australia/Melbourne"], ["LIMIT", 1]]
SELECT  "utcs".* FROM "utcs" WHERE "utcs"."value" = $1 LIMIT $2  [["value", "Asia/Tokyo"], ["LIMIT", 1]]
SELECT "utcs".* FROM "utcs"

  def add_city
    input = params[:input_city]
    puts "controller: #{input}"
    city = Utc.find_by_value(input)
---
SELECT  "utcs".* FROM "utcs" WHERE "utcs"."value" = $1 LIMIT $2  [["value", "Pacific/Niue"], ["LIMIT", 1]]