app/controllers/utc_tag_controller.rb

SELECT "utcs".* FROM "utcs" WHERE (value ILIKE '%%')
---
    def index
        @utcs = Utc.search(params[:term])
        render json: @utcs.map(&:value).uniq